adns
adwaita-icon-theme
atk
autoconf
autoconf-archive
automake
bat
bazel
bfs
blsd
boost
boost-python3
cairo
cairomm
cgal
chrome-cli
cmake
coreutils
ctags
desktop-file-utils
diff-so-fancy
direnv
docker
eigen
exa
fd
fondu
fontconfig
freetype
fribidi
fzf
gcc
gd
gdbm
gdk-pixbuf
gettext
girara
glib
glpk
gmp
gnumeric
gnupg
gnuplot
gnutls
go
gobject-introspection
goffice
google-sparsehash
gpgme
graph-tool
graphite2
gsettings-desktop-schemas
gtk+3
harfbuzz
hicolor-icon-theme
html2text
htop
icu4c
igraph
intltool
isl
itstool
jemalloc
jpeg
jq
libassuan
libcerf
libcroco
libepoxy
libevent
libffi
libgcrypt
libgpg-error
libgsf
libidn2
libksba
libmagic
libmpc
libnotify
libpng
librsvg
libsigc++
libsigc++@2
libtasn1
libtermkey
libtiff
libtool
libunistring
libusb
libuv
libvterm
libxml2
little-cms2
lua
luajit
lzo
meson
mpfr
msgpack
mutt
mysql
ncurses
neovim
nettle
ninja
node
npth
nspr
nss
numpy
oniguruma
openblas
openjdk
openjdk@11
openjpeg
openssl@1.1
osx-dictionary
p11-kit
pandoc
pango
pcre
pcre2
pinentry
pixman
pkg-config
poppler
protobuf
protobuf@3.7
py2cairo
py3cairo
pybind11
pygobject3
python
python3 -> python
python@2
python@3.8
qt
rarian
readline
reattach-to-user-namespace
redis
ripgrep
rustup-init
s-lang
scipy
spatialindex
sphinx-doc
sqlite
the_silver_searcher
tmux
tokyo-cabinet
tomcat
tree
unbound
unibilium
utf8proc
webp
wget
xml-coreutils
xz
yarn
zathura
zathura-pdf-poppler
zplug
